uhnp/src/DataProcessors/тн_ПересчетЦенВозвратовПоПартии/тн_ПересчетЦенВозвратовПоПартии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_ПересчетЦенВозвратовПоПартии</name>
  <comment>// Юдина Екатерина 08.05.2024 Выполнение задач №000049502</comment>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДокументов</name>
    <attributes>
      <name>Расхождение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВозвратТоваровПоставщику</name>
      <type>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПартии</name>
      <type>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОбработан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

uhnp/src/AccumulationRegisters/Закупки/Закупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Закупки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРеглБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаСкидки</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаДопРасходов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаДопРасходовБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВВалютеДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДСВВалютеДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВВалютеВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДСВВалютеВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникГФУНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.НачислениеОценочныхОбязательствПоОтпускам</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.РаспределениеРасходовБудущихПериодов</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ОтчетОператораСистемыПлатон</types>
      <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.ОтчетКомитентуОСписании</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.НачисленияКредитовИДепозитов</types>
      <types>DocumentRef.ОтчетПереработчика2_5</types>
      <types>DocumentRef.СчетФактураПолученныйНалоговыйАгент</types>
      <types>DocumentRef.СчетФактураНалоговыйАгент</types>
      <types>DocumentRef.ОтчетДавальцуМеждуОрганизациями</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникГФУРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗапасов</name>
    <type>
      <types>EnumRef.ТипыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетОператораСистемыПлатон</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ЗаказПереработчику2_5</types>
      <types>DocumentRef.ЗаказДавальца2_5</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ЗаказДавальца</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельностиНоменклатуры</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельностиКонтрагента</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодотчетноеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/DataProcessors/тн_ПересчетЦенВозвратовПоПартии/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Период.Вариант = ВариантСтандартногоПериода.СНачалаЭтогоКвартала;
	ЭтотОбъект.ОтборОрганизация = Ложь;
	ЭтотОбъект.ОтборКонтрагент = Ложь;
	
КонецПроцедуры 

 #КонецОбласти    

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ПериодПриИзмененииНаСервере();		

КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	
	Если Объект.Период.ДатаОкончания = Дата(01,01,0001) Тогда
		Объект.Период.ДатаОкончания = КонецДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	КонецЕсли;
	Если Объект.Период.ДатаНачала = Дата(01,01,0001) Тогда
		Объект.Период.ДатаНачала = НачалоМесяца(ОбщегоНазначения.ТекущаяДатаПользователя());
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПриИзменении(Элемент)
	
	ИмяРеквизита = "Отбор" + Элемент.Имя;
	ЭтотОбъект[ИмяРеквизита] = ЗначениеЗаполнено(Элемент.ТекстРедактирования);
	
КонецПроцедуры

#КонецОбласти    

 #Область ОбработчикиСобытийЭлементовТаблицыФормы
 
 &НаКлиенте
Процедура СписокДокументовПриАктивизацииСтроки(Элемент) 
	
	ТекДанные = Элемент.ТекущиеДанные;
	УстановитьОтборПоКлючу(ТекДанные);
	
КонецПроцедуры   

&НаКлиенте
Процедура СписокДокументовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)  
	
	ТекДанные = Элемент.ТекущиеДанные;
	УстановитьОтборПоКлючу(ТекДанные);

КонецПроцедуры

 #КонецОбласти 
 
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Инвертировать(Команда)
	
	ИнвертироватьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	ОтметитьВсеНаСервере();
	
КонецПроцедуры
                         
&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	СнятьОтметкиНаСервере();
	
КонецПроцедуры   

&НаКлиенте
Процедура Проверка(Команда) 
	
	ПроверкаНаСервере();  
	
КонецПроцедуры    

&НаКлиенте
Процедура ИсправитьЦены(Команда)
	
	ИсправитьЦеныНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаНаСервере()

	ЗапросТекст = ТекстЗапросаПроверка();
	ЗаполнитьТабличныеЧасти(ЗапросТекст, Истина);
	
КонецПроцедуры

 &НаСервере
Процедура ОтметитьВсеНаСервере()
	
	Для Каждого СтрТЗ Из Объект.СписокДокументов Цикл
		СтрТЗ.Расхождение = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СнятьОтметкиНаСервере()
	
	Для Каждого СтрТЗ Из Объект.СписокДокументов Цикл
		СтрТЗ.Расхождение = Ложь;
	КонецЦикла;
	
КонецПроцедуры
                   
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ЗапросТекст = ДобавитьОтборыВТекстЗапроса(ТекстЗапроса());
	ЗаполнитьТабличныеЧасти(ЗапросТекст);
	
КонецПроцедуры   

&НаСервере
Процедура ИнвертироватьНаСервере()
	
	Для Каждого СтрТЗ Из Объект.СписокДокументов Цикл
		СтрТЗ.Расхождение = Не СтрТЗ.Расхождение;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТабличныеЧасти(ТекстЗапроса, Проверка = Ложь)
	
	Данные = ПолучитьДанные(ТекстЗапроса, Проверка); 
	
	Если Проверка Тогда     
		ЗначениеВДанныеФормы(Данные[6].Выгрузить(), ТаблицаРасхождений);  
		Объект.СписокДокументов.Загрузить(Данные[5].Выгрузить());  
	Иначе
		Объект.СписокДокументов.Загрузить(Данные.Выгрузить());  
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьДанные(ТекстЗапроса, Проверка = Ложь)

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.Период.ДатаОкончания)+1);
	
	Если Проверка Тогда  
		Запрос.УстановитьПараметр("Таблица", Объект.СписокДокументов.Выгрузить()); 
		Результат = Запрос.ВыполнитьПакет();
	Иначе
		Результат = Запрос.Выполнить();
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция ТекстЗапроса()
	
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	        |	ЗакупкиОбороты.Регистратор КАК Регистратор
	        |ПОМЕСТИТЬ втРегистратор
	        |ИЗ
	        |	РегистрНакопления.Закупки.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику)
			|                                       //ОтборОрганизация 
			|                                       //ОтборКонтрагент 
			|                                       ) КАК ЗакупкиОбороты
	        |ГДЕ
	        |	ЗакупкиОбороты.Период >= &ДатаНачала
	        |	И ЗакупкиОбороты.Период <= &ДатаОкончания
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	        |	ВозвратТоваровПоставщикуТовары.Ссылка КАК ВозвратТоваровПоставщику,
	        |	ВозвратТоваровПоставщикуТовары.ДокументПоступления КАК ДокументПартии
	        |ИЗ
	        |	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	        |ГДЕ
	        |	ВозвратТоваровПоставщикуТовары.Ссылка В
	        |			(ВЫБРАТЬ
	        |				втРегистратор.Регистратор КАК Регистратор
	        |			ИЗ
	        |				втРегистратор КАК втРегистратор) 
			|УПОРЯДОЧИТЬ ПО
	        |	ВозвратТоваровПоставщикуТовары.Ссылка
	        |";
	
	Возврат Текст; 
	
КонецФункции

&НаСервере
Функция ДобавитьОтборыВТекстЗапроса(ТекстЗапроса)
	
	Если ОтборОрганизация Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ОтборОрганизация", "	И Организация = &Организация");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ОтборОрганизация","");
	КонецЕсли;
		
	Если ОтборКонтрагент Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ОтборКонтрагент", "	И Контрагент = &Контрагент");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ОтборКонтрагент", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции
                  
&НаСервере
Функция ТекстЗапросаПроверка()
	
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	        |	Таблица.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику,
	        |	Таблица.ДокументПартии КАК ДокументПартии
	        |ПОМЕСТИТЬ втРегистратор
	        |ИЗ
	        |	&Таблица КАК Таблица
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	втРегистратор.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику,
	        |	ВозвратТоваровПоставщикуТовары.Номенклатура КАК Номенклатура,
	        |	ВозвратТоваровПоставщикуТовары.Цена КАК ЦенаВозврат,
	        |	втРегистратор.ДокументПартии КАК ДокументПартии,
	        |	ПриобретениеТоваровУслугТовары.Цена КАК ЦенаПартия,
	        |	НАЧАЛОПЕРИОДА(ПриобретениеТоваровУслуг.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ВозвратТоваровПоставщикуДок.Дата, МЕСЯЦ)
	        |		И ПриобретениеТоваровУслугТовары.Цена <> ВозвратТоваровПоставщикуТовары.Цена КАК Расхождение,
	        |	ВозвратТоваровПоставщикуТовары.Характеристика КАК Характеристика,
	        |	ВозвратТоваровПоставщикуТовары.Серия КАК Серия
	        |ПОМЕСТИТЬ втДанные
	        |ИЗ
	        |	втРегистратор КАК втРегистратор
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	        |		ПО втРегистратор.ДокументПартии = ВозвратТоваровПоставщикуТовары.ДокументПоступления
	        |			И втРегистратор.ВозвратТоваровПоставщику = ВозвратТоваровПоставщикуТовары.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	        |		ПО втРегистратор.ДокументПартии = ПриобретениеТоваровУслугТовары.Ссылка
	        |			И (ПриобретениеТоваровУслугТовары.Номенклатура = ВозвратТоваровПоставщикуТовары.Номенклатура)
	        |			И (ПриобретениеТоваровУслугТовары.Характеристика = ВозвратТоваровПоставщикуТовары.Характеристика)
	        |			И (ПриобретениеТоваровУслугТовары.Серия = ВозвратТоваровПоставщикуТовары.Серия)
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	        |		ПО (ПриобретениеТоваровУслугТовары.Ссылка = ПриобретениеТоваровУслуг.Ссылка)
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщикуДок
	        |		ПО (ВозвратТоваровПоставщикуТовары.Ссылка = ВозвратТоваровПоставщикуДок.Ссылка)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	втРегистратор.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику,
	        |	втРегистратор.ДокументПартии КАК ДокументПартии,
	        |	втДанные.Номенклатура КАК Номенклатура,
	        |	втДанные.ЦенаВозврат КАК ЦенаВозврат,
	        |	втДанные.ЦенаПартия КАК ЦенаПартия,
	        |	втДанные.Расхождение КАК Расхождение,
	        |	втДанные.Серия КАК Серия,
	        |	втДанные.Характеристика КАК Характеристика
	        |ПОМЕСТИТЬ втИтоговая
	        |ИЗ
	        |	втРегистратор КАК втРегистратор
	        |		ЛЕВОЕ СОЕДИНЕНИЕ втДанные КАК втДанные
	        |		ПО втРегистратор.ВозвратТоваровПоставщику = втДанные.ВозвратТоваровПоставщику
	        |			И втРегистратор.ДокументПартии = втДанные.ДокументПартии
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ втРегистратор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ втДанные
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	втИтоговая.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику,
	        |	втИтоговая.ДокументПартии КАК ДокументПартии,
	        |	МАКСИМУМ(втИтоговая.Расхождение) КАК Расхождение
	        |ИЗ
	        |	втИтоговая КАК втИтоговая
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	втИтоговая.ВозвратТоваровПоставщику,
	        |	втИтоговая.ДокументПартии
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	втИтоговая.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику,
	        |	втИтоговая.ДокументПартии КАК ДокументПартии,
	        |	втИтоговая.Номенклатура КАК Номенклатура,
	        |	втИтоговая.Серия КАК Серия,
	        |	втИтоговая.Характеристика КАК Характеристика,
	        |	втИтоговая.ЦенаВозврат КАК ЦенаВозврат,
	        |	втИтоговая.ЦенаПартия КАК ЦенаПартия
	        |ИЗ
	        |	втИтоговая КАК втИтоговая
	        |ГДЕ
	        |	втИтоговая.Расхождение";
	
	Возврат Текст; 
	
КонецФункции

&НаСервере
Процедура ИсправитьЦеныНаСервере()
	
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	Таблица.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику,
	               |	Таблица.ДокументПартии КАК ДокументПартии
	               |ПОМЕСТИТЬ втРегистратор
	               |ИЗ
	               |	&Таблица КАК Таблица
	               |ГДЕ
	               |	Таблица.Расхождение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	втРегистратор.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику,
	               |	ВозвратТоваровПоставщикуТовары.Номенклатура КАК Номенклатура,
	               |	ВозвратТоваровПоставщикуТовары.Цена КАК ЦенаВозврат,
	               |	втРегистратор.ДокументПартии КАК ДокументПартии,
	               |	ВозвратТоваровПоставщикуТовары.Серия КАК Серия,
	               |	ВозвратТоваровПоставщикуТовары.Характеристика КАК Характеристика,
	               |	ПриобретениеТоваровУслугТовары.Цена КАК ЦенаПартия,
	               |	ПриобретениеТоваровУслугТовары.НомерСтроки КАК НомерСтрокиПартия,
	               |	ВозвратТоваровПоставщикуТовары.НомерСтроки КАК НомерСтрокиВозврат
	               |ПОМЕСТИТЬ втДанные
	               |ИЗ
	               |	втРегистратор КАК втРегистратор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	               |		ПО втРегистратор.ВозвратТоваровПоставщику = ВозвратТоваровПоставщикуТовары.Ссылка
	               |			И втРегистратор.ДокументПартии = ВозвратТоваровПоставщикуТовары.ДокументПоступления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	               |		ПО втРегистратор.ДокументПартии = ПриобретениеТоваровУслугТовары.Ссылка
	               |			И (ПриобретениеТоваровУслугТовары.Номенклатура = ВозвратТоваровПоставщикуТовары.Номенклатура)
	               |			И (ПриобретениеТоваровУслугТовары.Характеристика = ВозвратТоваровПоставщикуТовары.Характеристика)
	               |			И (ПриобретениеТоваровУслугТовары.Серия = ВозвратТоваровПоставщикуТовары.Серия)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	втРегистратор.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику,
	               |	втРегистратор.ДокументПартии КАК ДокументПартии,
	               |	втДанные.Номенклатура КАК Номенклатура,
	               |	втДанные.Серия КАК Серия,
	               |	втДанные.Характеристика КАК Характеристика,
	               |	втДанные.ЦенаВозврат КАК ЦенаВозврат,
	               |	втДанные.ЦенаПартия КАК ЦенаПартия,
	               |	втДанные.НомерСтрокиПартия КАК НомерСтрокиПартия,
	               |	втДанные.НомерСтрокиВозврат КАК НомерСтрокиВозврат,
	               |	ВЫРАЗИТЬ(втРегистратор.ДокументПартии КАК Документ.ПриобретениеТоваровУслуг).Дата КАК ДатаПартии,
	               |	ВЫРАЗИТЬ(втРегистратор.ВозвратТоваровПоставщику КАК Документ.ВозвратТоваровПоставщику).Дата КАК Дата,
	               |	ВЫРАЗИТЬ(втРегистратор.ДокументПартии КАК Документ.ПриобретениеТоваровУслуг).ЦенаВключаетНДС КАК ЦенаВключаетНДСПриобретение
	               |ИЗ
	               |	втРегистратор КАК втРегистратор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втДанные КАК втДанные
	               |		ПО втРегистратор.ВозвратТоваровПоставщику = втДанные.ВозвратТоваровПоставщику
	               |			И втРегистратор.ДокументПартии = втДанные.ДокументПартии
	               |ИТОГИ ПО
	               |	ВозвратТоваровПоставщику";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.Период.ДатаОкончания)+1);
	Запрос.УстановитьПараметр("Таблица", Объект.СписокДокументов.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  
	
	Пока Выборка.Следующий() Цикл  
						
		ВозвратОбъект = Выборка.ВозвратТоваровПоставщику.ПолучитьОбъект(); 
		ПроведениеЗапрещено = Ложь;
		ВыборкаДЗ = Выборка.Выбрать();
		Пока ВыборкаДЗ.Следующий() Цикл        
			
			// НАЧАЛО Белоконенко Денис 07.05.2026 Выполнение задач №000057385
			//Если НайденЗапретИзмененияДанных(ВыборкаДЗ.Дата) Тогда
			Если НайденЗапретИзмененияДанных(ВыборкаДЗ.Дата, ВозвратОбъект.Организация) Тогда
			// КОНЕЦ Белоконенко Денис 07.05.2026 Выполнение задач №000057385	
				
				Если Не ПроведениеЗапрещено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ " + ВыборкаДЗ.ВозвратТоваровПоставщику + " не будет перезаполнен, так как находится в закрытом периоде!");
					ПроведениеЗапрещено = Истина;
				КонецЕсли;
				Продолжить;
				
			КонецЕсли;	  
			
			Если НачалоМесяца(ВыборкаДЗ.ДатаПартии) <> НачалоМесяца(ВыборкаДЗ.Дата) Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ " + ВыборкаДЗ.ВозвратТоваровПоставщику + " не будет перезаполнен, так как возврат и партия находятся в разных периодах!");
				Продолжить;
				
			КонецЕсли;	
			
			СтрокаВозврат = ВозвратОбъект.Товары.Получить(ВыборкаДЗ.НомерСтрокиВозврат - 1); 
			
			СтрокаВозврат.Цена = ВыборкаДЗ.ЦенаПартия;
			
			СтруктураЗаполненияЦены = Новый Структура;
			СтруктураЗаполненияЦены.Вставить("ЦенаВключаетНДС", ВыборкаДЗ.ЦенаВключаетНДСПриобретение);
			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураЗаполненияЦены);
			СтруктураДействий.Вставить("ПересчитатьСумму", "Количество"); 
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураЗаполненияЦены);
			
			// НАЧАЛО Николаев Павел 30.06.2025 Выполнение задач №000054247
			//ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаВозврат, СтруктураДействий, Неопределено);
			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаВозврат, СтруктураДействий, Неопределено);
			// КОНЕЦ Николаев Павел 30.06.2025 Выполнение задач №000054247
			
		КонецЦикла;
		
		Если Не ПроведениеЗапрещено Тогда
			
			Если ВозвратОбъект.ЦенаВключаетНДС <> ВыборкаДЗ.ЦенаВключаетНДСПриобретение Тогда 
				ВозвратОбъект.ЦенаВключаетНДС = ВыборкаДЗ.ЦенаВключаетНДСПриобретение; 
			КонецЕсли;
			
			Попытка  
				ВозвратОбъект.Записать(РежимЗаписиДокумента.Проведение);   
				
			Исключение 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Произошла ошибка при записи документа " + Выборка.ВозвратТоваровПоставщику + " по причине: " + ОписаниеОшибки());
			КонецПопытки;  
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Белоконенко Денис 07.05.2026 Выполнение задач №000057385: + Организация 
//Функция НайденЗапретИзмененияДанных(Дата)
Функция НайденЗапретИзмененияДанных(Дата, Организация)
	
	ДанныеДляПроверки = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
	СтрокаДляПроверки = ДанныеДляПроверки.Добавить();
	СтрокаДляПроверки.Дата = Дата; 
	// НАЧАЛО Белоконенко Денис 07.05.2026 Выполнение задач №000057385
	СтрокаДляПроверки.Объект = Организация; 
	СтрокаДляПроверки.Раздел = "Закупки";
	// КОНЕЦ Белоконенко Денис 07.05.2026 Выполнение задач №000057385	
	Возврат ДатыЗапретаИзмененияСлужебный.НайденЗапретИзмененияДанных(ДанныеДляПроверки, "", "", Неопределено);
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборПоКлючу(ТекДанные)
	
	Если ТекДанные = Неопределено Тогда
 		Возврат;
	КонецЕсли;

	Отбор = Новый Структура;
	Отбор.Вставить("ВозвратТоваровПоставщику", ТекДанные["ВозвратТоваровПоставщику"]);  
	Отбор.Вставить("ДокументПартии", ТекДанные["ДокументПартии"]);

	Элементы.ТаблицаРасхождений.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);   
	
КонецПроцедуры

#КонецОбласти
